**TODO**

- Graficas
-

In [22]:
# imports
import os

import numpy as np  
import pandas as pd

In [23]:
current = os.getcwd () [ 0 : os.getcwd ().rfind( '\\' ) ]

# movielens dataset path
DATA_PATH = current + '\\dataset\\data.csv'
ITEM_PATH = current + '\\dataset\\item.csv'
USER_PATH = current + '\\dataset\\user.csv'

In [32]:
def load_set (name: str) -> pd.DataFrame: 

  if name == 'DATA':
    columns = [ 'userID', 'itemID', 'rating', 'timestamp' ]
    df = pd.read_csv ( 
      DATA_PATH, 
      names=columns, 
      sep='\t', 
      encoding='latin-1', 
      skipinitialspace=True 
    )
    # df.drop ( columns= [ 'timestamp' ] )
    return df
  
  if name == 'USER':
    columns = [ 'userID', 'age', 'gender', 'occupation', 'zipCode' ]
    df = pd.read_csv ( 
      USER_PATH, 
      names=columns, 
      sep='|', 
      encoding='latin-1', 
      skipinitialspace=True 
    )
    # df.drop ( columns= [ 'zipCode' ] )
    return df
  
  if name == 'ITEM':
    columns = [ 
      'itemID', 
      'name', 
      'releaseDate', 
      'videoReleaseDate', 
      'IMDbURL', 
      'gender_unknown', 
      'gender_action', 
      'gender_adventure', 
      'gender_animation', 
      'gender_children', 
      'gender_comedy',
      'gender_crime',
      'gender_documentary',
      'gender_drama',
      'gender_fantasy',
      'gender_film_noir',
      'gender_horror',
      'gender_musical',
      'gender_mystery',
      'gender_romance',
      'gender_scifi',
      'gender_thriller',
      'gender_war',
      'gender_western',
    ]
    df = pd.read_csv ( 
      ITEM_PATH, 
      names=columns, 
      sep='|', 
      encoding='latin-1', 
      skipinitialspace=True 
    )
    # df.drop ( columns= [ 'zipCode' ] )
    return df

In [33]:
df_data = load_set ( 'DATA' )
df_data

       userID  itemID  rating  timestamp
0         196     242       3  881250949
1         186     302       3  891717742
2          22     377       1  878887116
3         244      51       2  880606923
4         166     346       1  886397596
...       ...     ...     ...        ...
99995     880     476       3  880175444
99996     716     204       5  879795543
99997     276    1090       1  874795795
99998      13     225       2  882399156
99999      12     203       3  879959583

[100000 rows x 4 columns]

In [ ]:
df_item = load_set ( 'ITEM' )
df_item

In [34]:
df_user = load_set ( 'USER' )
df_user

     userID  age gender     occupation zipCode
0         1   24      M     technician   85711
1         2   53      F          other   94043
2         3   23      M         writer   32067
3         4   24      M     technician   43537
4         5   33      F          other   15213
..      ...  ...    ...            ...     ...
938     939   26      F        student   33319
939     940   32      M  administrator   02215
940     941   20      M        student   97229
941     942   48      F      librarian   78209
942     943   22      M        student   77841

[943 rows x 5 columns]